#include <iostream>
#include <string>
#include <cstdlib>

using namespace std;

//برنامه کلی رو اول بنویسیم بعدش تابعش میکنیم بعضی از قسمت هاشو که برنامه خوشگل تر بشه
//باید یه تابعی بنویسیم که کلمه ای که پیش فرضه رو به حروفش تقسیم کنه و توی یک ارایه بریزه چون موقع این که کاربر بخواد حرف مورد نظرشو وارد کنه بریم توی ارایه بگردیم
//ببینیم حرفه ایا تو ارایه تکرار شده چند بار تکرار شده و کجاها تکرار شده و با جای خالی حروف کلمات نشون دهیم که کجاست
int main(){
    char x , l;
    string w;
    //یک لیستی از کلمات رو در این جا داریم که با استفاده از تابع رندوم یکی از این کلمات رو انتخاب میکنیم و در متغیر correct_word
    //میریزیم و اوت تابعی که قراره کلمه رو حروف تبدیل کنه رو روش اجرا میکنیم
    ###.........//انتخاب کلمه رندوم
    string list[10]{"strawberry","apple","mango","cherry","lemon","orange","banana","peach","cucumber","greengage"};
    int random = rand()%10;
    string correct_word = list[random];
    ###.........
    //سپس اندازه ارایه روی برای کمک به کاربر که بدونه چند حرف است این کلمه پرینت میکنیم
    for (int fault_counter=0 ; fault_counter<6;){
        //ببین کلا این بخش برای اینه که ببینیم کاربر میخواد کلمه حدس بزنه یا حروف اگر کلمه رو درست حدس زد بازی تمومه اگه درست حدس نزد بهfault_counter یکی اضافه میکنیم
        cout<<"Do you want to guess a word(y/n):"<<endl;
        cin>>x;
        if ('x' == 'y'){
            cout<<"Now guess the word:"<<endl;
            cin>>w;
            if ("w" == "correct_word"){
                cout<<"You win"<<endl;
                break;
            }
            else
                fault_counter++;
        }
        if ('x' == 'n'){
            cout<<"Now guess the letter:"<<endl;
            cin>>l;
            //تازه برنامه از اینجا شروع میشه
            //در این جا بگو که حرف مورد نظرت چیه بعدش 
        }
    }
return 0;
}





###..........//نکاتی که نمیدونستم و موقع زدن سینتکس بهش برخوردم که اگه استادت ازت سوال کرد بدونی
//۱. نمیدونستم که این(') برای کاراکتر و این ("")برای استرینگ
//۲.کتابخونه سی اس تی دی.....برای تابع رندوم استفاده شده
